{
    "format": "layers-model",
    "generatedBy": "keras v2.2.4-tf",
    "convertedBy": "TensorFlow.js Converter v1.4.0",
    "modelTopology": {
        "keras_version": "2.2.4-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_16",
                "layers": [
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_16",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                1
                            ],
                            "dtype": "float32",
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "mean_squared_error",
            "metrics": [],
            "weighted_metrics": null,
            "sample_weight_mode": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 1.0,
                    "decay": 0.0,
                    "beta_1": 0.0,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_16/kernel",
                    "shape": [
                        1,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_16/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}